#문제 : N이 1이 될 때까지 두 과정 중 하나를 반복적으로 선택수행하는 방법은? 최소값을 출력하시오
n,k=map(int,input('두 수를 공백으로 분리하여 입력하시오>').split()) # N, K을 공백을 기준으로 구분하여 입력 받기
result = 0
while True: # 반복 루프 시작
    target =(n//k)*k 
# K로 나누어 지는 수를 구함, 예) 25 나누기 4 곱하기 4 = 처음 24
    result += (n - target) # N이 K로 나누어 떨어지는 수가 될 때까지 빼기, 1
    n = target # 25를 24로 수정
    if n < k: # N이 K보다 작을 때 (더 이상 나눌 수 없을 때) 반복문 탈출
        break
    result += 1 # 횟수 증가
    n //= k # K로 나누기, n = 6
result += (n - 1) # 마지막으로 남은 수에 대하여 1씩 빼기, 6, 5 --> 4일때까지 2번 추가 빼기, 마지막 1번 나누고
print("1이 도달하기 까지 연산 횟수 :", result) # 총 5번 횟수 연산